# üêº PANDAS

1Ô∏è‚É£ `What is Pandas?`
 - Pandas is a Python library used for data manipulation, cleaning, analysis, and preprocessing.

 - Pandas provides fast, flexible data structures like Series and DataFrame.

https://drive.google.com/file/d/1XzX1Fdq-uBHmBoKtBEwioLlMnTmrIsrG/view?usp=sharing

#### üîπ Series (1D)

 - 1D array
 - Has index
 - Similar to array but more powerful

In [ ]:
import pandas as pd

s = pd.Series([10, 20, 30])
print(s)

0    10
1    20
2    30
dtype: int64

#### üîπ DataFrame (2D) ‚≠ê‚≠ê

In [3]:
df = pd.DataFrame({
    "name": ["A", "B", "C"],
    "age": [20, 22, 21],
    "salary": [1000, 1500, 1200]
})
print(df)

  name  age  salary
0    A   20    1000
1    B   22    1500
2    C   21    1200

#### üîπ Column selection

In [ ]:
df["age"] # series
df[["name", "salary"]] # dataframe

  name  salary
0    A    1000
1    B    1500
2    C    1200

#### üîπ iloc (index based)

In [8]:
df.iloc[0]        # first row
df.iloc[0:2, 0]   # slicing

0    A
1    B
Name: name, dtype: object

#### üîπ loc (label based)

In [ ]:
df.loc[0, "age"]
df.loc[:1, ["name", "salary"]]
df.loc[:1] # last location always come (includes end)

  name  age  salary
0    A   20    1000
1    B   22    1500

### Difference between loc and iloc?

| loc          | iloc         |
| ------------ | ------------ |
| label-based  | index-based  |
| includes end | excludes end |

When to drop vs fill missing values?

‚úÖ Drop ‚Üí less missing

‚úÖ Fill ‚Üí important data

In [ ]:
import numpy as np

df = pd.DataFrame({
    "name": ["A", "B", "C"],
    "age": [20, np.nan, 21],
    "salary": [1000, 1500, 1200]
})

df.fillna(0)
df["age"].fillna(df["age"].mean())

df.dropna()
df.dropna(axis=1)

In [204]:
type(df.shape)

tuple

`shape is a property that stores metadata, while methods perform actions.`
 - ‚úÖ Tuple ‚Üí ‚û°Ô∏è returns (rows, columns)
 - Because shape is an attribute, not a method

In [206]:
df.shape
df.columns
df.index
df.dtypes
df.values

array([['A', 20.0, 1000],
       ['B', nan, 1500],
       ['C', 21.0, 1200]], dtype=object)

#### Difference between unique and nunique?

 - unique ‚Üí values

 - nunique ‚Üí count

In [ ]:
df["age"].value_counts() ## count present_element +=1
# df["age"].unique()
# df["age"].nunique()

age
20.0    1
21.0    1
Name: count, dtype: int64

### 8Ô∏è‚É£ Filtering Data

Why use `& not and` ?

‚úÖ Pandas works element-wise.

In [205]:
df[df["age"] > 20]
df[(df["age"] > 20) & (df["salary"] > 1000)]
df[(df['age'].isnull()) & (df['salary'] > 1000)]

  name  age  salary
1    B  NaN    1500

### GroupBy (TOP INTERVIEW QUESTION) ‚≠ê‚≠ê‚≠ê‚≠ê

What does groupby return?

‚úÖ GroupBy object (lazy execution)

In [37]:
df.groupby("name")["salary"].mean()

name
A    1000.0
B    1500.0
C    1200.0
Name: salary, dtype: float64

 - Multiple aggregation

In [40]:
df.groupby("age").agg({
    "salary": ["mean", "max"],
    "name": "count"
})

      salary        name
        mean   max count
age
20.0  1000.0  1000     1
21.0  1200.0  1200     1

### Sorting

In [44]:
df.sort_values("salary")
df.sort_values("salary", ascending=False)
df.sort_values("salary", ascending=True)

  name   age  salary
0    A  20.0    1000
2    C  21.0    1200
1    B   NaN    1500

## 1Ô∏è‚É£1Ô∏è‚É£ Apply vs Map vs Applymap (VERY CONFUSING ‚Üí INTERVIEW)

`üîπ map (Series only)
üîπ apply (row/column)
üîπ applymap (element-wise)`

Difference between apply & applymap?

 - `apply` ‚Üí row/column

 - `applymap & map` ‚Üí element

In [ ]:
df["age"].map(lambda x: x + 1)
df["salary"].apply(lambda x: x * 1.1) 
## if single colunm apply function working like a map

0    21.0
1     NaN
2    22.0
Name: age, dtype: float64

In [50]:
df.apply(np.sum)
df[["salary","age"]].map(lambda x: x * 1.1)

   salary   age
0  1100.0  22.0
1  1650.0   NaN
2  1320.0  23.1

In [56]:
df.applymap(lambda x: x)
# df.map(lambda x: x)

/tmp/ipykernel_9399/3700379568.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x)

  name   age  salary
0    A  20.0    1000
1    B   NaN    1500
2    C  21.0    1200

### 1Ô∏è‚É£2Ô∏è‚É£ Merge, Join, Concat 

Difference between merge and concat?

 - merge ‚Üí key based

 - concat ‚Üí axis based

In [ ]:
df1 = pd.DataFrame({
    "name": ["A", "B", "C"],
    "age": [20, np.nan, 21],
    "salary": [1000, 1500, 1200]
})

df2 = pd.DataFrame({
    "name": ["D", "E", "F"],
    "age": [22, 24, 23],
    "salary": [900, 1600, 1200]
})


pd.concat([df1, df2],axis=0)
pd.concat([df1, df2],axis=1)
# concat ‚Üí axis based

  name   age  salary name  age  salary
0    A  20.0    1000    D   22     900
1    B   NaN    1500    E   24    1600
2    C  21.0    1200    F   23    1200

In [ ]:
df1 = pd.DataFrame({
    "name": ["A", "B", "C"],
    "age": [20, np.nan, 21],
    "salary": [1000, 1500, 1200]
})

df2 = pd.DataFrame({
    "name": ["A", "B", "C"],
    "age": [22, 24, 23],
    "salary": [900, 1600, 1200]
})

pd.merge(df1, df2, on="name", how="inner")
# merge ‚Üí key based

  name  age_x  salary_x  age_y  salary_y
0    A   20.0      1000     22       900
1    B    NaN      1500     24      1600
2    C   21.0      1200     23      1200

| how   | meaning   |
| ----- | --------- |
| inner | common    |
| left  | left all  |
| right | right all |
| outer | all       |

### Q1Ô∏è‚É£ Difference between Pandas and NumPy?

 - NumPy ‚Üí numerical arrays

 - Pandas ‚Üí labeled, structured data

### Q2Ô∏è‚É£ How do you handle large CSV files?

 - chunksize

 - dtype optimization

 - use only required columns

In [ ]:
pd.read_csv("data.csv", chunksize=1000)

In [ ]:
# Q3Ô∏è‚É£ How to remove duplicates?
df.drop_duplicates()

# Q4Ô∏è‚É£ How to rename columns?
df.rename(columns={"name": "Name"})

## Q5Ô∏è‚É£ How to change datatype?
df["age"] = df["age"].astype(str)

df.info()
df.describe()

            salary
count     3.000000
mean   1233.333333
std     251.661148
min    1000.000000
25%    1100.000000
50%    1200.000000
75%    1350.000000
max    1500.000000

In [73]:
df["age"] = df["age"].astype(float)

In [ ]:
## Find rows where salary > mean salary.
df[df['age'] > df['age'].mean()]

## Count null values per column.
df.isnull().sum()

## Find top 2 highest salaries.
df['salary'].sort_values(ascending=False)
# s.sort_values(key=lambda x: x.str.lower())

## Remove rows where age is null and salary < 1000.

  name   age  salary
0    A  20.0    1000
1    B   NaN    1500
2    C  21.0    1200

In [148]:
import pandas as pd

data = {
    "emp_id": [101, 102, 103, 104, 105, 106],
    "name": ["A", "B", "C", "D", "E", "F"],
    "dept": ["IT", "HR", "IT", "HR", "IT", "Finance"],
    "salary": [5000, 4000, 6000, None, 5500, 4500],
    "experience": [2, 3, 5, 1, None, 4]
}

data = pd.DataFrame(data)
data

   emp_id name     dept  salary  experience
0     101    A       IT  5000.0         2.0
1     102    B       HR  4000.0         3.0
2     103    C       IT  6000.0         5.0
3     104    D       HR     NaN         1.0
4     105    E       IT  5500.0         NaN
5     106    F  Finance  4500.0         4.0

#### ‚ùì Find average salary per department (ignore nulls)

In [118]:
## ‚ùì Find average salary per department (ignore nulls)
data.groupby('dept')['salary'].mean()
#data.groupby(['dept']).value_counts()

dept
Finance    4500.0
HR         4000.0
IT         5500.0
Name: salary, dtype: float64

#### ‚ùì Find employees with salary greater than department average

 - transform() returns same-size Series ‚Üí perfect for filtering.

In [ ]:
display(data)

dept_avg = data.groupby("dept")["salary"].transform("mean")
data[data["salary"] > dept_avg]

   emp_id name     dept  salary  experience
0     101    A       IT  5000.0         2.0
1     102    B       HR  4000.0         3.0
2     103    C       IT  6000.0         5.0
3     104    D       HR     NaN         1.0
4     105    E       IT  5500.0         NaN
5     106    F  Finance  4500.0         4.0

   emp_id name dept  salary  experience
2     103    C   IT  6000.0         5.0

In [144]:
dp_avg = data.groupby('dept')['salary'].mean()
display(dp_avg) ## every department salary mean()
dept_avg = data.groupby("dept")["salary"].transform("mean")
display(dept_avg) 
## transform("mean") if in null value and fill every row its avg selary

dept
Finance    4500.0
HR         4000.0
IT         5500.0
Name: salary, dtype: float64

0    5500.0
1    4000.0
2    5500.0
3    4000.0
4    5500.0
5    4500.0
Name: salary, dtype: float64

#### ‚ùì Replace missing salary with department average

Why not use apply here?

‚úÖ transform is faster and vectorized.

Q2Ô∏è‚É£ Difference between `apply() and transform()`?

apply ‚Üí reduces dimension

transform ‚Üí same shape output

In [147]:
data["salary"] = data["salary"].fillna(
    data.groupby("dept")["salary"].transform("mean")
)
data

   emp_id name     dept  salary  experience
0     101    A       IT  5000.0         2.0
1     102    B       HR  4000.0         3.0
2     103    C       IT  6000.0         5.0
3     104    D       HR  4000.0         1.0
4     105    E       IT  5500.0         NaN
5     106    F  Finance  4500.0         4.0

#### ‚ùì Find department with maximum total salary

In [160]:
data.groupby('dept')['salary'].sum().idxmax()

'IT'

Difference between `size() and count()`?

size ‚Üí counts NaN

count ‚Üí ignores NaN

In [162]:
data['dept'].value_counts()
data.groupby('dept').size()

dept
Finance    1
HR         2
IT         3
dtype: int64

In [ ]:
## ‚ùì Sort employees by salary within each department

df.sort_values(["dept", "salary"], ascending=[True, False])

   emp_id name     dept  salary  experience
5     106    F  Finance  4500.0         4.0
1     102    B       HR  4000.0         3.0
3     104    D       HR     NaN         1.0
2     103    C       IT  6000.0         5.0
4     105    E       IT  5500.0         NaN
0     101    A       IT  5000.0         2.0

In [173]:
def label_salary(x):
    if x >= 5500:
        return "High"
    elif x >= 4500:
        return "Medium"
    else:
        return "Low"

df["salary_level"] = df["salary"].apply(label_salary)
df

   emp_id name     dept  salary  experience salary_level
0     101    A       IT  5000.0         2.0       Medium
1     102    B       HR  4000.0         3.0          Low
2     103    C       IT  6000.0         5.0         High
3     104    D       HR     NaN         1.0          Low
4     105    E       IT  5500.0         NaN         High
5     106    F  Finance  4500.0         4.0       Medium

In [192]:
## ‚ùì Find second highest salary
df["salary"].dropna().nlargest(2).iloc[-1]

df["salary"].dropna().nlargest(2).iloc[-1]

np.float64(5500.0)

In [193]:
df["experience"].fillna(df["experience"].median(), inplace=False)

0    2.0
1    3.0
2    5.0
3    1.0
4    3.0
5    4.0
Name: experience, dtype: float64

In [196]:
df.isnull().values.shape

(6, 6)